/**
 * 1. 写一个正则表达式 匹配所有 Number 直接量
 * 2. 写一个 UTF-8 Encoding 的函数
 * 3. 写一个正则表达式，匹配所有的字符串直接量，单引号和双引号
 */

// 十进制：
const decimal = /^(([1-9]?[0-9]+.?)(.[0-9]+)?)|()([1-9]?[0-9]+)|(.[0-9]+)$/;

// 二进制：
const binary = /^0b[0-1]+$/;

// 八进制：
const octal = /^0o[0-7]+$/;

// 十六进制：
const hexadecimal = /^0x([0-9]|[A-F])$/;

// Number
const number = /^((([1-9]?[0-9]+.?)(.[0-9]+)?)|()([1-9]?[0-9]+)|(.[0-9]+))|(0o[0-7]+)|(0x([0-9]|[A-F]))$/;
// 草稿：/[0-9]+.?|.[0-9]+|[1-9]+.[0-9](e|E)10+|0b[0-1]+|0o[0-7]+|0x[0-9A-F]+/;

function utf8ToEncoding(str) {
  return str
    .split("")
    .map((s) => `\\u${s.charCodeAt().toString(16)}`)
    .join("");
}

// '""' /^'[^']*'$/
// "''" /^"[^"]*"$/
const str = /^('[^']*')|("[^"]*")$/;